The line representing the top of a riser does not intersect one or both of the boundary lines.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId StairRiserDoesntIntersectBoundaryError { get; }
  Visual Basic
Public Shared ReadOnly Property StairRiserDoesntIntersectBoundaryError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StairRiserDoesntIntersectBoundaryError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace